{
  "book": "JST Exodus",
  "chapter": 27,
  "reference": "JST Exodus 27",
  "verses": [
    {
      "verse": 1,
      "reference": "JST Exodus 27:1",
      "text": "And thou shalt make an altar of shittim wood, five cubits **long** and five cubits broad; the altar shall be **foursquare;** and the height thereof shall be three cubits."
    },
    {
      "verse": 2,
      "reference": "JST Exodus 27:2",
      "text": "And thou shalt make the horns of it upon the four corners **thereof;** his horns shall be of the **same;** and thou shalt overlay it with brass."
    },
    {
      "verse": 3,
      "reference": "JST Exodus 27:3",
      "text": "And thou shalt make his pans to receive his ashes, and his shovels, and his basins, and his fleshhooks, and his **firepans; and** all the vessels thereof thou shalt make of brass."
    },
    {
      "verse": 4,
      "reference": "JST Exodus 27:4",
      "text": "And thou shalt make for it a grate of network of brass; and upon the net shalt thou make four **brazen** rings in the four corners thereof."
    },
    {
      "verse": 5,
      "reference": "JST Exodus 27:5",
      "text": "And thou shalt put it under the compass of the altar beneath, that the net may be even to the midst of the altar."
    },
    {
      "verse": 6,
      "reference": "JST Exodus 27:6",
      "text": "And thou shalt make staves for the altar, staves of shittim wood, and overlay them with brass."
    },
    {
      "verse": 7,
      "reference": "JST Exodus 27:7",
      "text": "And the staves shall be put into the rings, and the staves shall be upon the two sides of the altar, to bear it."
    },
    {
      "verse": 8,
      "reference": "JST Exodus 27:8",
      "text": "Hollow with boards shalt thou make **it;** as it was **showed** thee in the mount, so **shalt thou** make it."
    },
    {
      "verse": 9,
      "reference": "JST Exodus 27:9",
      "text": "And thou shalt make the court of the **tabernacle;** for the south side southward there shall be hangings for the court of fine twined linen of **a** hundred cubits long for one **side;**"
    },
    {
      "verse": 10,
      "reference": "JST Exodus 27:10",
      "text": "And the twenty pillars thereof and their twenty sockets shall be of brass; the hooks of the pillars and their fillets shall be of silver."
    },
    {
      "verse": 11,
      "reference": "JST Exodus 27:11",
      "text": "And likewise for the north side in length there shall be hangings of **a** hundred cubits long, and his twenty pillars and their twenty sockets of **brass,** the hooks of the pillars and their fillets of silver."
    },
    {
      "verse": 12,
      "reference": "JST Exodus 27:12",
      "text": "And for the breadth of the court on the west side shall be hangings of fifty **cubits,** their pillars ten, and their sockets ten."
    },
    {
      "verse": 13,
      "reference": "JST Exodus 27:13",
      "text": "And the breadth of the court on the east side eastward shall be fifty cubits."
    },
    {
      "verse": 14,
      "reference": "JST Exodus 27:14",
      "text": "The hangings of one side of the gate shall be fifteen **cubits,** their pillars **three** and their sockets three."
    },
    {
      "verse": 15,
      "reference": "JST Exodus 27:15",
      "text": "And on the other side shall be hangings fifteen **cubits,** their pillars **three** and their sockets three."
    },
    {
      "verse": 16,
      "reference": "JST Exodus 27:16",
      "text": "And for the gate of the court shall be **a** hanging of twenty cubits, of blue, and purple, and scarlet, and fine twined **linen** wrought with **needlework;** and their pillars shall be **four** and their sockets four."
    },
    {
      "verse": 17,
      "reference": "JST Exodus 27:17",
      "text": "All the pillars round about the court shall be filleted with silver; their hooks shall be of **silver** and their sockets of brass."
    },
    {
      "verse": 18,
      "reference": "JST Exodus 27:18",
      "text": "The length of the court shall be **a** hundred cubits, and the breadth fifty **everywhere,** and the height five cubits of fine twined linen, and their sockets of brass."
    },
    {
      "verse": 19,
      "reference": "JST Exodus 27:19",
      "text": "All the vessels of the tabernacle in all the service thereof, and all the pins thereof, and all the pins of the **court** shall be of brass."
    },
    {
      "verse": 20,
      "reference": "JST Exodus 27:20",
      "text": "And thou shalt command the children of Israel, that they bring thee pure oil **olive,** beaten for the light, to cause the lamp to burn always."
    },
    {
      "verse": 21,
      "reference": "JST Exodus 27:21",
      "text": "In the tabernacle of the congregation without the veil, which is before the testimony, Aaron and his sons shall order it from evening to morning before the **Lord;** it shall be a statute **forever** unto their generations on the behalf of the children of Israel."
    }
  ]
}